app/controllers/api/adventures_controller.rb

    def index
      adventures = Adventure.all
---
SELECT "adventures".* FROM "adventures"

    def show
      adventure = Adventure.find(params[:id])
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT 1  [["id", 2]]

    def create
      # binding.pry
      adventure = Adventure.create(location: params[:location], activity: params[:activity], business: params[:business], comments: params[:comments])
---
INSERT INTO "adventures" ("location", "activity", "business", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", "asdsads"], ["activity", "asdasd"], ["business", "asdasd"], ["comments", "asdasd"], ["created_at", "2015-05-28 00:39:11.180697"], ["updated_at", "2015-05-28 00:39:11.180697"]]

    def update
      adventure = Adventure.find(params[:id])
      adventure.update(id: params[:id], location: params[:location], activity: params[:activity], business: params[:business], comments: params[:comments])
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "adventures" SET "location" = $1, "activity" = $2, "business" = $3, "comments" = $4, "updated_at" = $5 WHERE "adventures"."id" = $6  [["location", ""], ["activity", ""], ["business", ""], ["comments", ""], ["updated_at", "2015-05-28 19:15:25.354500"], ["id", 1]]

    def destroy
      adventure = Adventure.find(params[:id])
      adventure.destroy
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "adventures" WHERE "adventures"."id" = $1  [["id", 5]]